org-posts/posts.org
#+hugo_base_dir: ../
#+hugo_section: post
#+property: header-args :eval no

*** DONE Fundamentos de git II
    CLOSED: [2019-09-23 lun 12:18]
    :PROPERTIES:
    :EXPORT_FILE_NAME: fundamentos-git-2
    :END:
Este artículo tiene como objetivo profundizar en el manejo de Git con el uso de *ramas* y *repositorios remotos*.
#+hugo: more

**** Videotutoriales
  - [[https://youtu.be/goMcUY9dZzM][Sesión 2.1]]
  - [[https://youtu.be/1vMheWF6VXo][Sesión 2.2]]
  - [[https://youtu.be/aYDyT85NOLg][Sesión 2.3]]
  - [[https://youtu.be/hBJMwbxb-fc][Sesión 2.4]]

**** Índice
      - Ramas
      - Fusiones de ramas
      - Conflictos
      - Remotos
      - Flujos de trabajo con ramas

**** Referencias
  - [[https://git-scm.com/book/es/v2/][Libro de Git]]
  - [[https://services.github.com/on-demand/downloads/es_ES/github-git-cheat-sheet/][Hoja de referencia de Git]]
  - [[https://services.github.com/on-demand/downloads/es_ES/github-git-cheat-sheet.pdf][Hoja de referencia de Git (PDF)]]
  - [[http://git-school.github.io/visualizing-git/][Herramienta "Visualizing Git"]] (muy interesante para comprender el funcionamiento interno de Git y el trabajo con ramas y remotos)

**** Contenidos
***** Ramas
****** Definición de ramas
   - Una rama es un puntero que apunta a un determinado commit.
   - Un repositorio debe tener una rama como mínimo.
   - El nombre de la rama que se crea por defecto es ~master~. Este nombre no es especial ni tiene una función o significado especial.
   - Existe un puntero especial llamado ~HEAD~ que apunta a la rama en la que estamos en ese momento.
   - Al cambiar de rama se modifica el contenido del directorio de trabajo: éste se muestra tal como estaba en la rama a la que hemos saltado.
   - La creación y el cambio de ramas se realizan de forma instantánea: no tienen apenas coste.
   - El trabajo con ramas es muy interesante por los siguientes motivos:
     - Se pueden hacer pruebas sin modificar el código en producción.
     - Se puede separar el trabajo en tareas o subproyectos que no afecten unos a otros.
     - Cada miembro del equipo puede trabajar sin ser interferido por los demás.

****** Crear ramas
    #+begin_src bash
    git branch <nombre_rama>
    #+end_src

****** Ver ramas disponibles
    #+begin_src bash
    git branch
    #+end_src

****** Cambiar de rama
    #+begin_src bash
    git checkout <nombre_rama>
    #+end_src

****** Fusionar una rama
   - Primero nos posicionamos en la rama sobre la que se va a realizar la fusión
   - Para realizar la fusión ejecutar:


    #+begin_src bash
    git merge <nombre_rama_a_fusionar>
    #+end_src
 
****** Eliminar una rama
    #+begin_src bash
    git branch -d <nombre_rama>
    #+end_src

***** Remotos
****** Clonar un repositorio
    #+begin_src bash
    git clone <URL_REPOSITORIO>
    #+end_src

****** Ver remotos
    #+begin_src bash
    git remote -v
    #+end_src

****** Añadir, eliminar y renombrar remotos
    #+begin_src bash
    git remote add <NOMBRE_REMOTO> <URL_REPOSITORIO>   # Añadir remoto
    git remote rm <NOMBRE_REMOTO>                      # Eliminar remoto
    git remote rename <NOMBRE_ORIGINAL> <NOMBRE_NUEVO> # Renombrar remoto
    #+end_src

****** Traer información del remoto
    #+begin_src bash
    # Este comando NO realiza la fusión en la rama local
    # Si se desean incorporar los cambios habría que realizar un git merge
    git fetch [NOMBRE_REMOTO] # El nombre del remoto por defecto es ORIGIN
    #+end_src

****** Traer y fusionar cambios del remoto
    #+begin_src bash
    git pull [NOMBRE_REMOTO] [NOMBRE_RAMA] # Pull = fetch + merge
    #+end_src

****** Enviar cambios al remoto
    #+begin_src bash
    git push [NOMBRE_REMOTO] [NOMBRE_RAMA]
    #+end_src

****** Enviar los cambios de una rama al remoto y crear una rama remota asociada
    #+begin_src bash
    git push -u NOMBRE_REMOTO NOMBRE_RAMA
    #+end_src
